import IVacanciesResponse, { IVacancy } from "../models/vacancyModel";

const data: IVacanciesResponse = {
  objects: [
    {
      id: 35276608,
      payment_from: 13350,
      payment_to: 19300,
      profession: "Продавец (подработка) Пермь, Архитектора Свиязева, 42",
      town: {
        title: "Пермь",
      },
      type_of_work: {
        title: "Неполный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p>Для каждого, кто без опыта, хочет работать и зарабатывать! Для каждого, кто готов к подработке и карьерному росту! «Пятерочка» приглашает на работу!</p><p><br /></p><p>ЧЕМ НУЖНО ЗАНИМАТЬСЯ:</p><ul><li>Работа в торговом зале</li><li>Консультация покупателей</li><li>Выкладка и отслеживание сроков годности товаров</li></ul><p>ОТ НАС:</p><ul><li>Смены от 4-х часов, по выходным или по вечерам</li><li>Возможность совмещать с учебой или работой </li><li>Оформление по ТК РФ</li><li>Фиксированный оклад + премии и надбавки за стаж </li><li>Медицинская книжка за счет компании </li><li>Скидки в магазинах сети</li><li>Медицинская страховка в формате телемедицины</li></ul><p>ОТ ВАС:</p><ul><li>Желание работать с покупателями, остальному научим!</li></ul><p>Наша вакансия также подойдет вам, если вы искали: ежедневная подработка, без опыта, курьер, уборщица, администратор, разнорабочий, продавец, грузчик, официант, промоутер, кладовщик, сборщик заказов, работа для студента, начинающий специалист</p><p><br /></p><p><br /></p><p><br /></p>",
    },
    {
      id: 46371595,
      payment_from: 0,
      payment_to: 0,
      profession: "Solution Architect (Архитектор решений)",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<br /><br /><b>Условия:</b><br /><ul><li>Нам требуется Solution architect с опытом разработки мироксервисной архитектуры в высоконагруженных решениях для разработки новой версии продукта на современном технологическом стеке. На нашем продукте ты, как архитектор, сможешь с нуля поднять и сопроводить крупное решение, которое будет распространяться в РФ, СНГ, Африке, Латинской Америке и Ближнем Востоке.<ul><li>Официальное оформление по ТК РФ.</li><li>Конкурентная зарплата по итогам интервью, наличие премиальной составляющей.</li><li>ДМС.</li><li>Необходимая техника и софт для работы;</li><li>Методология разработки - SCRUM, масштабирования - LeSS.</li><li>Корпоративные мероприятия: корпоративы, внутренние лекции, командообразование, pizzaday и т.п.</li></ul></li><li>Рассматриваем вариант удаленного сотрудничества в формате full time, либо формат работы в офисе в одном из городов присутствия (Москва, Красноярск, Белгород).<br /></li></ul><b>Требования:</b><br /><ul><li>От 6 лет опыта работы в разработке заказного программного обеспечения.<ul><li>От 2 лет опыта работы в роли техлида или архитектора.</li><li>Знание шаблонов проектирования (Enterprise, SOA, Microservices, EDA).</li><li>Понимание stateful и stateless приложений, микросервисной архитектуры;</li><li>Опыт с шинами данных (например, RabbitMQ, Kafka);</li><li>Опыт с SQL и NoSQL;</li><li>Опыт технологий контейнеризации и оркестрации - Docker, Kubernetes;</li><li>Опыт подготовки технической документации.</li></ul></li></ul><b>Обязанности:</b><br /><ul><li>Подготовка проекта к разработке, в т.ч. финализация технологического стека.<br /></li><li>Разработка архитектуры и архитектурных артефактов.<br /></li><li>Архитектурный надзор и решение сложных технических задач вместе с командами.<br /></li><li>Контроль проектной и технической документации на всем жизненном цикле продукта.<br /></li><li>Консультация команд разработки по вопросам применения технического стека.</li><li>Поиск и документирование для команд наилучших практик применения технологий.</li><li>ode RevСiew.</li><li>Тренинги для команд по архитектурным приемам, лучшим практикам и т.п.</li></ul>",
    },
    {
      id: 42446431,
      payment_from: 150000,
      payment_to: 0,
      profession: "Разработчик PHP",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p><b>Botobot</b>\n – один из самых успешных сервисов для интеграции мессенджеров и \nчат-ботов в продажи в России и СНГ. У нас более полутора миллионов пользователей\n и больше 45 тысяч магазинов. Мы расширяем функционал наших сервисов и ищем бекенд разработчика в команду. Вам предстоит заниматься интересными задачами по развитию нагруженной SaaS платформы. <br /></p><p>Мы используем php 8.1, MySQL 8, Redis. Инфраструктура сервиса размещается в облаке AWS. Часть инфраструктуры оркестрируется через Kubernetes, другая часть в процессе переезда. В проекте мы используем EKS, RDS, ElastiCache, CloudWatch и тд. Над задачами работаем в Confluence, Jira, Gitlab.<br /></p><b><b>Мы ожидаем, что Вы:</b></b><ul><li>Имеете опыт разработки на PHP7.1+ более 2х лет</li><li>Работали с фреймворками Symfony, API-Platform, Yii2<br /></li><li>Работали с реляционными базами данных</li><li>Умеете проектировать и реализовывать API</li><li>Имеете опыт работы с Docker<br /></li></ul><b>Условия:</b><ul><li>Полностью удаленная работа<br /></li><li>Гибкий рабочий график<br /></li></ul>",
    },
    {
      id: 45706493,
      payment_from: 0,
      payment_to: 0,
      profession: "Ведущий Java-разработчик (Команда ДКБ CRM)",
      town: {
        title: "Екатеринбург",
      },
      type_of_work: {
        title: "Сменный график работы",
      },
      currency: "rub",
      vacancyRichText:
        '<p>Ищем талантливого Java-разработчика для работы над задачами команды ДКБ CRM.</p><p>В работе используем стек технологий и инструменты: Java 11,14, Spring Framework 5, Hibernate Oracle, PostgreSQL, Mockito, Jenkins, Tomcat, Kafka.</p><p>Методология разработки - "Scrumban".</p><p>В команде есть владелец продукта, техлид, тимлид, аналитики, разработчики, скрам-мастер.</p><p>Что предстоит:</p><ul><li>Разработка архитектуры и самого решения для backend части приложения;</li><li>Проектирование и разработка интерфейсов приложений/ключевых технологических и прикладных микросервисов платформы;</li><li>Внедрять новые фичи - мы активно работаем с фидбеком клиентов и постоянно улучшаем наши продукты</li><li>Оптимизировать скорость работы приложений (куда без этого);</li><li>Взаимодействие с разработчиками, аналитиками, дизайнерами и другими командами</li></ul><p>Нам нужен человек, который:</p><ul><li>Высшее техническое, математическое или другое профильное образование (в том числе курсы повышения квалификации) в сфере ИТ;</li><li>Java SE 8 или выше, Spring Framework 5, принципы SOLID;</li><li>Знание паттернов проектирования;</li><li>Знание методологии TDD и понимание, как правильно писать тесты (модульные, интеграционные);</li></ul><p>Будет плюсом:</p><ul><li>Опыт разработки на Groovy.</li><li>Опыт разработки Enterprise приложений;</li><li>Знание шаблона проектирования Domain-Driven Design;</li><li>Умение писать SQL запросы.</li></ul><p>Мы предлагаем:</p><ul><li>Гибкий график и удаленный формат;</li><li>Развитие внутри команды, регулярные code review;</li><li>Уровень ЗП обсуждаем индивидуально (ожидания+скиллы), все белое, полное соблюдение ТК РФ;</li><li>ДМС + стоматология;</li><li>Наши сотрудники имеют возможность оформить льготные кредиты и ипотеку;</li><li>Увлекательную корпоративную жизнь и даже удаленно.</li></ul>',
    },
    {
      id: 45706574,
      payment_from: 0,
      payment_to: 0,
      profession: "Ведущий Java-разработчик",
      town: {
        title: "Екатеринбург",
      },
      type_of_work: {
        title: "Сменный график работы",
      },
      currency: "rub",
      vacancyRichText:
        '<p>Ищем талантливого Java-разработчика для работы над задачами команды ДКБ CRM.</p><p>В работе используем стек технологий и инструменты: Java 11,14, Spring Framework 5, Hibernate Oracle, PostgreSQL, Mockito, Jenkins, Tomcat, Kafka.</p><p>Методология разработки - "Scrumban".</p><p>В команде есть владелец продукта, техлид, тимлид, аналитики, разработчики, скрам-мастер.</p><p>Что предстоит:</p><ul><li>Разработка архитектуры и самого решения для backend части приложения;</li><li>Проектирование и разработка интерфейсов приложений/ключевых технологических и прикладных микросервисов платформы;</li><li>Внедрять новые фичи - мы активно работаем с фидбеком клиентов и постоянно улучшаем наши продукты</li><li>Оптимизировать скорость работы приложений (куда без этого);</li><li>Взаимодействие с разработчиками, аналитиками, дизайнерами и другими командами</li></ul><p>Нам нужен человек, который:</p><ul><li>Высшее техническое, математическое или другое профильное образование (в том числе курсы повышения квалификации) в сфере ИТ;</li><li>Java SE 8 или выше, Spring Framework 5, принципы SOLID;</li><li>Знание паттернов проектирования;</li><li>Знание методологии TDD и понимание, как правильно писать тесты (модульные, интеграционные);</li></ul><p>Будет плюсом:</p><ul><li>Опыт разработки на Groovy.</li><li>Опыт разработки Enterprise приложений;</li><li>Знание шаблона проектирования Domain-Driven Design;</li><li>Умение писать SQL запросы.</li></ul><p>Мы предлагаем:</p><ul><li>Гибкий график и удаленный формат;</li><li>Развитие внутри команды, регулярные code review;</li><li>Уровень ЗП обсуждаем индивидуально (ожидания+скиллы), все белое, полное соблюдение ТК РФ;</li><li>ДМС + стоматология;</li><li>Наши сотрудники имеют возможность оформить льготные кредиты и ипотеку;</li><li>Увлекательную корпоративную жизнь и даже удаленно.</li></ul>',
    },
    {
      id: 45706575,
      payment_from: 0,
      payment_to: 0,
      profession: "Ведущий Java-разработчик",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Сменный график работы",
      },
      currency: "rub",
      vacancyRichText:
        '<p>Ищем талантливого Java-разработчика для работы над задачами команды ДКБ CRM.</p><p>В работе используем стек технологий и инструменты: Java 14, Spring Framework 5, Hibernate Oracle, PostgreSQL, Mockito, Jenkins, Tomcat, Kafka.</p><p>Методология разработки - "Scrumban".</p><p>В команде есть владелец продукта, техлид, тимлид, аналитики, разработчики, скрам-мастер.</p><p>Что предстоит:</p><ul><li>Разработка архитектуры и самого решения для backend части приложения;</li><li>Проектирование и разработка интерфейсов приложений/ключевых технологических и прикладных микросервисов платформы;</li><li>Внедрять новые фичи - мы активно работаем с фидбеком клиентов и постоянно улучшаем наши продукты</li><li>Оптимизировать скорость работы приложений (куда без этого);</li><li>Взаимодействие с разработчиками, аналитиками, дизайнерами и другими командами</li></ul><p>Нам нужен человек, который:</p><ul><li>Высшее техническое, математическое или другое профильное образование (в том числе курсы повышения квалификации) в сфере ИТ;</li><li>Java SE 8 или выше, Spring Framework 5, принципы SOLID;</li><li>Знание паттернов проектирования;</li><li>Знание методологии TDD и понимание, как правильно писать тесты (модульные, интеграционные);</li></ul><p>Будет плюсом:</p><ul><li>Опыт разработки на Groovy.</li><li>Опыт разработки Enterprise приложений;</li><li>Знание шаблона проектирования Domain-Driven Design;</li><li>Умение писать SQL запросы.</li></ul><p>Мы предлагаем:</p><ul><li>Гибкий график и удаленный формат;</li><li>Развитие внутри команды, регулярные code review;</li><li>Уровень ЗП обсуждаем индивидуально (ожидания+скиллы), все белое, полное соблюдение ТК РФ;</li><li>ДМС + стоматология;</li><li>Наши сотрудники имеют возможность оформить льготные кредиты и ипотеку;</li><li>Увлекательную корпоративную жизнь и даже удаленно.</li></ul>',
    },
    {
      id: 45715747,
      payment_from: 125000,
      payment_to: 0,
      profession: "Инженер-программист",
      town: {
        title: "Нижний Новгород",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<b>Обязанности:</b><ul><li>Разработка встроенного ПО для микроконтроллерных систем со стандартными и нестандартными процессорными ядрами;</li><li>Настройка среды разработки под изменения внутренней структуры микроконтроллерной системы (изменение количества и/или функционального назначения интерфейсных блоков и внутренних блоков системы и т.п.);</li><li>Разработка математических моделей и эмуляторов разрабатываемых IP-блоков микроконтроллерной систем;</li><li>Разработка тестов для выполнения функционального моделирования разрабатываемых микроконтроллерных систем и их составных частей;</li><li>Разработка документации на разработанное ПО;</li></ul><p><b>Требования:</b></p><ul><li>Навыки программирования микроконтроллеров (языки С/С++, Python, TCL), знание периферийных интерфейсов (UART, I2C, SPI, CAN, SDIO, USB, MIPI, SATA и т.д.);</li><li>Опыт работы в средах проектирования Eclipse, Keil и пр., а также их настройки при изменении конфигурации микроконтроллерной системы, опыт создания HAL библиотек;</li><li>Навыки отладки микроконтроллерных систем с использованием GDB, OpenOCD и пр. Также настройка их ( GDB, OpenOCD) конфигурации под разрабатываемую микроконтроллерную систему;</li><li>Навыки работы в среде ОС Linux, Windows, с системами контроля версий;</li><li>Английский язык — чтение технической документации, ведение переписки;</li></ul><p><b>Условия:</b></p><ul><li>Оформление согласно ТК РФ;</li><li>Инновационные проекты;</li><li>Зарубежные командировки: тренинги, партнеры;</li><li>Премии согласно выполненным задачам;</li><li>Гибкий график</li><li>R&D центр г. Москва, ст. м. Тушинская (6 мин. пешком от метро)</li></ul>",
    },
    {
      id: 46144991,
      payment_from: 142500,
      payment_to: 0,
      profession: "Старший программист 1С",
      town: {
        title: "Волгоград",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        '<p><b>Обязанности:</b></p><ul><li>Настройка, доработка и обновление сильно измененной "1С: Комплексная автоматизация 1.1";</li><li>Настройка и регулярное обновление типовой 1С: Управление бухгалтерией 3.0";</li><li>Настройка, доработка и сопровождение системы складского учета "1С: WMS";</li><li>Настройка, доработка и сопровождение интеграции между конфигурациями;</li><li>Разработка технических заданий (схем) на доработку конфигураций, разработка инструкций, написание пользовательской документации;</li><li>Консультирование пользователей;</li><li>Администрирование ИБ;</li><li>Ведение учета рабочего времени.</li></ul><b>Требования:</b><ul><li>Опыт работы на аналогичной должности от 3 лет;</li><li>Хорошее знание платформы 1С 8.2 (обычные формы), механизмов интеграции ИС (Конвертация 2.0). Знание типовых решений 1С (одна или несколько КА, УПП, ERP, БП, ЗУП, УТ, Логистика);</li><li>Уверенное владение технологией СКД;</li><li>Умение работать с транзакциями, блокировками;</li><li>Знание основ бухгалтерского и управленческого учета;</li><li>Умение разбираться в чужом коде;</li><li>Умение разрабатывать технические задания и способы их реализации;</li><li>Приветствуется знание MS SQL;</li><li>Высокая ответственность, внимательность, организованность, умение работать в команде. </li></ul><b>Условия:</b><ul><li>Работа удаленно на своем оборудование (ПК, доступ в интернет);</li><li>Оформление по ТК РФ;</li><li>График работы 5/2 с 8:00 до 17:00;</li><li>Испытательный срок - 3 месяца;</li><li>Официальная заработная плата 2 раза в месяц на карту банка.</li></ul>',
    },
    {
      id: 43809315,
      payment_from: 60000,
      payment_to: 0,
      profession:
        "Инженер-программист бюро технологической подготовки и сопровождения производства",
      town: {
        title: "Энгельс",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<b>Обязанности:</b><ul><li>Разработка управляющих программ для машин плазменной и газовой резки в программах Техтран, ProNest, программ для механообрабатывающих станков с ЧПУ(Siemens, Fanuc NC-201). Составление программ для гибочных прессов. Составление карт раскроя. Решение технологических задач, связанных с техническим сопровождением процесса производства продукции в цехе.</li><li><b>Предоставляем жилье</b></li></ul><b>Требования:</b><ul><li>Высшее техническое образование, специализация программирование станков с ЧПУ</li></ul><b>Условия:</b><ul><li>Полный соц. пакет, доставка бесплатно на работу и с работы по Саратову и Энгельсу</li><li>Стабильная заработная плата</li><li>Отличная столовая на территории предприятия</li><li>Медпункт на территории предприятия</li><li>Наличие парковки</li><li>Удобная транспортная доступность</li></ul>",
    },
    {
      id: 46198836,
      payment_from: 90000,
      payment_to: 0,
      profession: "Программист 1С",
      town: {
        title: "Омск",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p>Приглашаем в команду Австосервисов  REAKTOR Программиста 1С.  Ждем профессионала своего дела, вместе с которым по четким ТЗ будем выстраивать работу.</p><p>Обязанности:</p><ul><li>Разработка и сопровождение программного обеспечения предприятия, предназначенного для автоматизации управленческого, кадрового, бухгалтерского учета, расчета заработной платы;</li><li>сопровождение конфигураций 1С</li><li>написание разнообразных обработок и отчетов;</li><li>разработка нового функционала;</li><li>настройка и выполнение различных обменов данных;</li></ul>Требования:<ul><li>Опыт работы</li><li>Знание теории программирования</li><li>Навыки разработки 1С</li><li>Умение самостоятельно находить решения</li></ul>Условия:<ul><li>своевременную выдачу заработной платы, 2 раза в месяц</li><li>льготное питание в собственной столовой</li><li>бассейн</li><li>полный соц.пакет</li><li>профессиональный рост</li></ul>",
    },
    {
      id: 45348504,
      payment_from: 85000,
      payment_to: 0,
      profession: "Product Manager / Архитектор продуктов",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        '<b>Обязанности:</b><ul><li>Разработка\n  и защита концепций продуктов аэропорта, их свойств, бизнес-связей, требований\n  к производству, автоматизации, учету</li><li>Управление маркетинговыми проектами, включает в себя открытие проекта в\n  качестве заказчика, контроль за исполнением этапов проекта, принятие и оценка\n  результатов проекта</li><li>Управление процессом ценообразования расчёт и управление тарифами\n  предприятия</li><li>Разработка плана маркетинговых мероприятий и контроль их реализации</li><li>Анализ эффективности реализации продуктов и выработка корректирующих\n  мероприятий</li><li>Разработка и управление маркетинговой политикой предприятия</li><li>Сбор и анализ маркетинговой информации и подготовка профильного\n  отчета</li></ul><b>Требования:</b><br /><ul><li>Образование: высшее (специализация: математика и механика, физико-технические науки и технологии, экономика и управление, компьютерные и информационные науки)</li><li>Знание иностранного языка: Английский B1</li><li>Опыт работы от 1 года (рассматриваем кандидатов без опыта работы  при наличии профильного образования Маркетинг, Информационные технологии, Управление проектом, Инновационный менеджмент)</li></ul><p><b>Условия:</b></p><ul><li>График работы: 5/2</li><li>Место\n  работы "Аэропорт Домодедово"</li><li>\n    Стабильная официальная заработная плата (3 раза в месяц: оклад и премия)</li><li>\n    Оформление по ТК РФ</li><li>\n    Ежегодный медосмотр </li><li>\n    Льготное корпоративное питание</li><li>\n    Компенсация фитнес-абонемента</li><li>\n    Оплачиваемый отпуск и оплата больничных листов</li><li>\n    Корпоративные мероприятия</li><li>\n    Программы лояльности от компаний-партнеров</li></ul>',
    },
    {
      id: 46277766,
      payment_from: 0,
      payment_to: 0,
      profession: "Руководитель группы разработки ПО (Техлид)",
      town: {
        title: "Красноярск",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        '<p><i>       Мы молодая, но уже известная на региональном рынке </i><i>IT</i><i>-компания. В нашей  команде  талантливые разработчики, креативные дизайнеры, опытные аналитики, ответственные менеджеры проектов. Результат нашей работы -   активно используемые в государственном управлении информационные системы, отмеченные на всероссийских конкурсах "ПРОФ-IT" и "ПРОФ-IT Инновация". Разрабатываем с нуля, внедряем и сопровождаем сложные информационные системы. Вас ждёт широкий спектр интересных задач, позволяющих расти профессионально и реализовывать свои творческие амбиции.</i></p><p><b>     Ищем амбициозного руководителя группы разработки программного обеспечения (техлида) для работы в Красноярске </b>от 30 лет,который будет отвечать за работу своей команды, качество, которое они производят, скорость и темп, с которыми они работают, но, что наиболее важно – за общий рост людей в ней. <b>Важен опыт работы в данной сфере от 4-х лет/высшее профильное образование.</b></p><p><b>Мы используем:</b></p><p>·        Angular (Ionic);</p><p>·        HTML5, AJAX, CSS3, SASS;</p><p>·        TypeScript;</p><p>·        RxJS;</p><p>·        REST;</p><p>·        Python (Django)</p><p>·        Java Spring Boot</p><p><b>Плюсом со стороны кандидата будет:</b></p><p>·        Наличие минимальных управленческих навыков;</p><p>·        Опыт работы с Docker, Kubernetes, Harbor;</p><p>·        Опыт в написании спецификаций OpenAPI;</p><p>·        Уверенное знание TypeScript;</p><p>·        Грамотное ведение Git репозитория</p><p><b>Мы ценим</b><b>:</b></p><p>·        Стремление к росту;</p><p>·        Умение работать в команде, неконфликтность;</p><p>·        Умение доносить свою мысль;</p><p>·        Умение задавать тон (желание быть основой того, чего ожидают от остальной команды);</p><p>·        Внимание к деталям, мелочам;</p><p>·        Чувство юмора</p><p><b>Обязанности:</b></p><p>·        Развивать командную экспертность;</p><p>·        Работать в команде c разработчиками, тестировщиками, дизайнерами;</p><p>·        Внедрять новые технологии, понимать, как эти технологии используются в рамках проектов;</p><p>·        Обеспечивать эффективные коммуникации между членами команды (разработчики, тестировщики, дизайнеры, аналитики);</p><p>·        Отвечать за результаты разработки продуктов;</p><p>·        Помогать переводу задач бизнеса в задачи, понятные разработчикам;</p><p>·        Работать над несколькими проектами параллельно;</p><p>·        Быть наставником группы разработки до 20 человек.</p><p><b>Мы предлагаем</b><b>:</b></p><p>·        Официальное трудоустройство согласно ТК РФ;</p><p>·        Очную работу в офисе в центре города (пр. Мира) с доступом к любому виду транспорта;</p><p>·        График работы: пятидневная рабочая неделя с 9:00 до 18:00 или с 8:00 до 17:00;</p><p>·        Занятия английским 2 раза в неделю за счёт компании;</p><p>·        Официальное трудоустройство согласно ТК РФ;</p><p>·        Уровень “белой” з/пл. по результатам собеседования + премии;</p><p>·        Комфортные условия труда, оборудованная кухня, чай, кофе, дружный молодой коллектив;</p><p>·        ДМС за счёт компании;</p><p>·        Сопровождение наставника в роли начальника проектно-аналитического отдела на первых этапах работы;</p><p>·        Кафетерий льгот: обучение (накоплена обширная база курсов), спорт, отдых, туризм;</p><p>·        Возможность профессионального и карьерного роста;</p><p>·        Большие проекты краевого масштаба;</p><p>·        Развитую корпоративную культуру (мы проводим масштабные корпоративные мероприятия, дарим новогодние подарки детям, спортивные мероприятия, награждаем лучших сотрудников, поддерживаем в трудных жизненных ситуациях)<br /><br /></p><p>Перспективы</p><p>Прохождение курсов повышения квалификации за счёт компании, участие в различных семинарах, конференциях</p><p>Порядок отклика</p><p><b>Для рассмотрения вакансии, присылайте резюме и 2-3 свежие и лучшие работы по указанному электронному адресу.</b></p><p>После получения резюме с Вами свяжутся и назначат время для прохождения собеседования в офисе нашей компании. Благодарим за проявленный интерес.</p>',
    },
    {
      id: 46368254,
      payment_from: 125000,
      payment_to: 145000,
      profession: "Наладчик-программист станков с ЧПУ",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p><b>Металлообрабатывающее\nпроизводство приглашает на работу наладчика-программиста ЧПУ станков.</b></p><p><b>Обязанности:</b></p><p>Работа с токарными станками;</p><p>Настройка данных станков, обеспечение их\nработоспособности, передача в работу операторам, периодический контроль\nкачества изготавливаемых  деталей;</p><p>Программирование управляющих программ со стоек FANUC,\nSinumerik, Siemens, корректировка исполнения написанных программ;</p><p>Разработка технических процессов для ускорения обработки;</p><p>Обеспечение своевременного заказа запасных частей и\nрасходных материалов;</p><p>Доведение режущего инструмента под требуемые параметры\nкачества деталей;</p><p>Взаимодействие с 3-6 операторами.</p><p><b>Требования:</b></p><p>Образование не ниже среднего специального;</p><p>Опыт работы от 3 лет, либо 2-6 разряд;</p><p>Умение программировать стойки FANUC, Sinumerik, Siemens;<br />\nУмение читать чертежи и спецификации;</p><p>Знание приемов обработки металлов;</p><p>Дисциплинированность, обязательность, трудолюбие, желание\nзарабатывать.</p><p><b>Условия:</b></p><p>Официальное трудоустройство по ТК РФ;</p><p>Оклад + премия, совокупно 125-145 т.р.;</p><p>График 5/2, обсуждаем;</p><p>Территориально м. Окружная, Верхние Лихоборы, в 10\nминутах пешком.</p>",
    },
    {
      id: 46368393,
      payment_from: 200000,
      payment_to: 250000,
      profession: "Программист КА\\ERP",
      town: {
        title: "Казань",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p>Обязанности:</p><ul><li>Разработка нового с нуля и/или доработка уже существующего функционала 1С-конфигураций</li><li>Внедрение и поддержка учетных систем на платформе «1С Предприятие 8», (основной вектор – Комплексная, БП)</li><li>Написание инструкции пользователю по заданию для работы в Ка-2.</li><li>Настройка прав доступа по пользователям.</li><li>Написание обработок по плану обмена, по обмену с ККМ, по обмену с площадками и т.д.</li><li>Обновление программы 1С</li><li>Устранение ошибок в 1С</li><li>Знание программы 1С: Комплексная автоматизация.</li></ul><p>Требования:</p><ul><li><p>Владение СКД на уровне программного кода</p></li><li><p>Опыт создания/доработки обменов данными с внешними системами через REST API (CRM Битрикс, МП Ozon итд)</p></li><li><p>Опыт обновления не типовых доработанных конфигураций</p></li><li><p>Опыт внедрения и программирования как минимум в одном из типов 1С-конфигураций: торговля (УТ10.3, УТ11.x) или бухгалтерия (БП2.0, БП 3.0)</p></li><li><p>Аналитичность, самообучаемость</p></li><li><p>Умение работать в команде</p></li></ul><p>Условия:</p><ul><li>Возможна дистанционная работа ( если Вы живете не в Казани, мы вас тоже рассмотрим).</li><li>Рассматриваем на подработку, детали обговариваем на собеседовании.</li><li>Оформление по ТК РФ</li><li>График работы 5\\2 с 9.00-18.00</li><li>Карьерный рост</li><li>Работа в дружной команде, поддержка на всех этапах</li><li>Скидки на продукцию</li><li>Возможность обучения</li></ul>",
    },
    {
      id: 46376437,
      payment_from: 0,
      payment_to: 0,
      profession: "Разработчик рецептур полимерного воска",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<b>Обязанности:</b><br /><b>Требования:</b><ul><li>Разработка рецептуры воска для депиляции</li></ul><b>Условия:</b><ul><li>Оплата сдельная</li></ul>",
    },
    {
      id: 46376472,
      payment_from: 160000,
      payment_to: 0,
      profession: "Программист 1С",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p>Обязанности:</p><p>- Изучение и погружение в бизнес-процессы компании;</p><p>- Разработка решений по внедрению бизнес-процессов в программу;</p><p>- Планирование стадий внедрения в зависимости от потребностей бизнеса;</p><p>- Выявление проблем, разработка решений, работа с 1 линией поддержки;</p><p>- Ведение проектной документации;</p><p>- Активное взаимодействие со сторонними сервисами, площадками в рамках внедрения сторонних продуктов.</p><p>- Ведение задач, учет времени как своего так и команды.</p><p>- Создание и поддержка спейсов, бордов и фильтров команды, обеспечение прозрачности процесса и результатов команды.</p><p>- Организация тестирования продукта перед эксплуатацией.</p><p>- Содержание продукта в бесперебойной среде функционирования</p><p>- Доработка/разработка продукта на платформе 1С</p><p>- Управление бэклогом;</p><p>- Управление рисками;</p><p>Требования:</p><ul><li><p>Что мы ждем от успешного кандидата на эту роль:</p><p>- Играющий тренер;</p><p>- Опыт управления проектами в сфере ИТ от 3 лет;</p><p>- Хороший опыт в организации процесса разработки и написании соответствующих регламентов;</p><p>- Опыт управления проектами по внедрению решений на базе 1С. Опыт участия в создании новых конфигураций/продуктов 1С;</p><p>- Техническая грамотность и коммуникабельность;</p><p>- Умение быстро переключаться в режиме многозадачности и принимать решения;</p><p>- Знание и Умение работать с большими Базами данных.</p>- Отличные организационные и аналитические навыки.</li></ul><p>Условия:</p><ul><li><p>Заработная плата по результатам собеседования от 160000-250000 руб</p></li><li><p>График работы 5/2;</p></li><li><p>Оформление по ТК РФ</p></li></ul><p><br /></p>",
    },
    {
      id: 45695572,
      payment_from: 100000,
      payment_to: 500000,
      profession: "Системный программист Linux",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<b>Обязанности:</b><ul><li><p>Системные вызовы Linux; </p></li><li><p>Стандарт POSIX, библиотека libc, механизмы взаимодействия параллельных процессов,\nмногопоточное программирование (multi-thread); - Make (хорошие знания\nMakefile-ов), gdb, svn/git.<br /></p></li></ul><b>Требования:</b><ul><li>Знание Си, Си++, bash,\nperl/lua, sed/awk/grep;</li><li>Хороший технический английский (чтение).</li><li>Желательно знакомство с криптоалгоритмами ГОСТ, знание PKI (сертификаты, CRL, PKCS10, CMS), Знание ASN.1. Знание OpenSSL (хотя бы на уровне\nAPI).</li><li>Хороший опыт работы в Linux/Unix системах, знание основных\nутилит командной строки, средств отладки;</li><li>Знание TCP/IP сетей\nи модели OSI;</li><li>Опыт написания\nпереносимого и безопасного кода;</li><li>Опыт\nпрограммирования и отладки в режиме ядра (kernel mode);</li><li>Навыки использования: valgrind, gdb, objdump, strace,\ntcpdump;</li><li>Умение разобраться в чужом коде;</li><li>Опыт написания сетевых демонов;</li><li>Умение анализировать\nkernel panic;</li><li>Знание ассемблера x86-64;</li><li>Понимание архитектуры современных ОС;</li><li>Личные качества: аккуратность, адекватность, логика, мотивация, трудолюбие, способность обучаться и глубоко разбираться в проблемах;</li><li>Желание/умение работать в команде.</li></ul><p><b>Навыки:</b></p><ul><li>Английский язык\n     (технический)</li></ul><p><b>Условия:</b></p><ul><li>Зарплата обсуждается в зависимости от опыта работы, уровня\nквалификации и соответствия требованиям вакансии;</li><li>Возможность профессионального и карьерного роста;</li><li>Оформление по ТК РФ (трудовой договор, трудовая книжка);</li><li>Расположение офиса:\nмежду м. ул. 1905 г. и м. Беговая (с 8-00 до 20-30 автобус компании по\nрасписанию возит сотрудников к / от метро).    </li></ul>",
    },
    {
      id: 45706734,
      payment_from: 80000,
      payment_to: 0,
      profession: "Архитектор-реставратор",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        '<p>В компанию, осуществляющую работы по реставрации, реконструкции и ремонту (в том числе и на объектах культурного наследия федерального значения), требуется архитектор-реставратор.<b><br /></b></p><b>Обязанности:</b><p><b>- </b>Проведение обследования объекта культурного наследия</p><p>- Разработка проектной документации по реставрации объекта культурного наследия с увязкой со смежными разделами</p><p>- Участие в процедурах согласования и прохождения экспертиз в государственных организациях</p><p><b>Требования:</b></p><p>- Высшее образование</p><p>- Владение AutoCAD</p><p>- Аналогичный опыт работы от 3 лет</p><p>- Знание нормативно-технической литературы, федеральных законов, статей ГК РФ, ГОСТ, относящихся к разделу "Архитектурные решения"</p><b>Условия:</b><p>- График работы пн-пт с 9.00 до 18.00</p><p>- Официальное оформление</p><p>- Заработная плата оклад уже "чистыми на руки", после вычета налога от 80 000 р. (Точный уровень обсуждается на собеседовании, зависит от опыта работы и навыков кандидата)</p><p>- Стабильные выплаты два раза в месяц (аванс и з.п.)</p><p>- Оплата отпуска и б/л</p>',
    },
    {
      id: 45720632,
      payment_from: 250000,
      payment_to: 250000,
      profession: "Программист 1С (Не удаленно)",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p><b>Программист 1С (ОФИС)</b></p> <p>Группа компаний FAVORIT MOTORS – официальный дилер более 15 зарубежных автоконцернов: Volkswagen, KIA, Renault, Peugeot, Volvo, Ford, Citroen, Chevrolet, Cadillac, Skoda, Hyundai, Mazda, Haval, Exeed, Geely, Сhery, Changan.</p> <p>Холдинг является одним из лидеров российского рынка авторитейла и входит в топ-10 лучших дилеров Москвы по объёмам продаж.</p> <p>Группа компаний была основана 23 февраля 1994 года. За 29 лет успешной работы она смогла стать надежным партнером как для корпоративных, так и для частных клиентов.</p> <p>Сеть FAVORIT MOTORS включает более 30 филиалов. Это автосалоны и сертифицированные производителями сервисные центры, которые удобно расположены в различных районах столицы. Штат компании насчитывает более 1600 специалистов.</p> <p>Холдинг создает для сотрудников оптимальные условия труда. Благодаря постоянному внедрению инноваций компания двигается вперед, а работники совершенствуют мастерство.</p> <p>Для наших сотрудников мы гарантируем высокий уровень заработной платы, который ограничен лишь Вашими амбициями и способностями.</p> <p><b>ОБЯЗАННОСТИ:</b></p> <p><b>ВНИМАНИЕ - В ОФИСЕ!</b></p> <ul><li>Разработка в среде 1С 8.3, управляемые формы (тонкий клиент)</li> <li>Настройки обмена между системами КД, КД2</li> <li>Чтение “чужого кода”, оптимизация алгоритмов и запросов</li> <li>Работа с интеграционными моделями с использованием XML, JSON, CSV (http запросы, Adodb)</li> <li>Поддержка ИБ, администрирование (обновление не типовых конфигураций)</li> <li>Поддержка пользователей, консультация (инструкции, технические описания решений)</li> <li>Оценка временных затрат на задачи</li> </ul><p><b>ТРЕБОВАНИЯ:</b></p> <p>При наличии базовых навыков и некоторого аналогичного опыта работы рассматривается возможность дополнительного обучения в процессе работы.</p> <p>Уровень мотивации, в этом случае, обсуждается на собеседовании.</p> <ul><li>Программирование в среде 1С 8.3, управляемые формы (тонкий клиент) (не менее 3-х лет), знание БСП (как преимущество)</li> <li>Профильное образование</li> <li>Хорошее знание типовых механизмов «Зарплата и управление персоналом» 3.1 и «Бухгалтерия предприятия» 3.0.</li> <li>Опыт работы с нетиповыми конфигурациями (желательно).</li> <li>Знания SQL, T-SQL (как преимущество).</li> <li>Знание основ администрирования баз данных СУБД MS SQL</li> <li>Знание бухгалтерского учета и расчета заработной платы</li> <li>Опыт работы с интеграционными моделями: http запросы, аdodb</li> <li>Хорошие знания администрирования сервера 1С</li> <li>Техническая грамотность, самостоятельность и ответственность.</li> </ul><p><b>УСЛОВИЯ:</b></p> <p><b>Место работы: Дилерский центр - Москва, 3 км МКАД, внешняя сторона (на уровне г.Реутов), проезд от м. Новогиреево/Новокосино</b></p> <ul><li>Оформление по ТК РФ с первого дня работы</li> <li>Выплата вознаграждения 2 раза в месяц по зарплатному проекту в «Сбербанке»</li> <li>Оплачиваемый отпуск (28 календарных дней)</li> <li>Скидка на обслуживание личного автомобиля в сервисных центрах компании;</li> <li>Скидка на питание в кафе на территории ГК Фаворит Моторс;</li> <li>Скидка на приобретение автомобиля в салонах компании;</li> <li>Выгодные условия на приобретение страховых продуктов;</li> <li>Профессиональные конкурсы с очень мотивирующими призами;</li> <li>Музей Автомобильных историй (специальная тарифная сетка на все услуги Музея для сотрудников и их детей);</li> <li>Поощрительные поездки от производителей авто и FAVORIT MOTORS;</li> <li>Билеты на концерты от компании и партнеров (Новогодние елки, фестивали, премьерные кинопоказы, театральные постановки, концерты);</li> <li>Welcome pack (выдаем брендированные атрибуты рабочего места).</li> </ul>",
    },
    {
      id: 46199522,
      payment_from: 0,
      payment_to: 260000,
      profession: "Руководитель группы прикладной разработки (техлид)",
      town: {
        title: "Москва",
      },
      type_of_work: {
        title: "Полный рабочий день",
      },
      currency: "rub",
      vacancyRichText:
        "<p><b>Обязанности:</b><ul><li>Определение оптимальных технологий для реализации текущих задач;</li><li>Разработка архитектуры прикладных информационных систем;</li><li>Написание программного кода на языках Java и Kotlin с использованием лучших практик и актуальных фреймворков;</li><li>Координация процесса разработки в части написания программного кода и отладки, доведение принятых принципов и архитектурных решений до других программистов (включая подрядчиков), а также проведение код-ревью;</li><li>Оформление технической документации по программным решениям. </li></ul><b>Требования:</b><ul><li>Высшее техническое образование;</li><li>Не менее 5 лет в сфере разработки программного обеспечения;</li><li>Уверенное знание Java 17+ и Kotlin 1.7, владение фреймворком Spring 5 и 6 версии (включая его экосистему – Spring Boot, Security, JPA и т.п.);</li><li>Уверенное знание SQL (преимущественно PostgreSQL) и способов использования баз данных в экосистеме Java – JDBC, Hibernate;</li><li>Понимание принципов микросервисной архитектуры, опыт внедрения и использования средств мессаджинга (Apache Kafka);</li><li>Уверенное знание средств разработки (IntelliJ IDEA, GitLab) и опыт работы с ПО для организации процесса разработки (Jira, Confluence);</li><li>Коммуникабельность (умение четко формулировать мысли, доносить их до подчиненных и решать возникающие недопонимания).</li><li>Будет преимуществом:</li><li>Опыт работы с JavaScript/TypeScript, в частности, с фронтенд-фреймворком Vue3;</li><li>Наличие собственной лицензии на IntelliJ IDEA;</li><li>Опыт работы с шаблонизатором Thymeleaf;</li><li>Опыт работы с Groovy;</li><li>Опыт работы в руководящих должностях в сфере IT.</li></ul><b>Условия:</b><ul><li>Оформление по ТК РФ, заработная плата полностью «белая» и выплачивается в срок;</li><li>Оборудованное рабочее место в главном здании Университета у ст.м. «Тропарево», «Юго-Западная», «Коньково»;</li><li>Очная форма работы с обсуждаемым графиком и присутствием;</li><li>Бронирование от призыва в порядке, установленном законодательством. </li></ul></p>",
    },
  ],
  total: 321925,
};

export function useFavoriteVacancies(ids: IVacancy["id"][]) {
  let vacancies = data.objects.filter((el) => ids.includes(el.id));
  return vacancies;
}

export default useFavoriteVacancies;
